artilleryStress.yml
config:
  target: "http://ec2-3-16-208-224.us-east-2.compute.amazonaws.com:5050"
  processor: './artilleryFunctions.js'
  phases:
    - duration: 60
      arrivalRate: 100
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
      - function: 'randomizer'
      - get:
          url: "/api/pictures/{{listingID}}"