artilleryStress.yml
config:
  target: "http://ec2-3-16-208-224.us-east-2.compute.amazonaws.com"
  processor: './artilleryFunctions.js'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - name: "Retrieve an image carousel"
    flow:
      - function: 'randomizer'
      - post:
          url: "/{id}"
          # json:
          #   id: '{{id}}'