artilleryStress.yml
config:
  target: "http://localhost:5050"
  processor: './artilleryFunctions.js'
  phases:
    - duration: 60
      arrivalRate: 1000
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
      - function: 'randomizer'
      - get:
          url: "/api/pictures/{{listingID}}"