artilleryStress.yml
config:
  target: "http://ec2-3-16-208-224.us-east-2.compute.amazonaws.com:5050"
  processor: './artilleryFunctions.js'
  phases:
    - duration: 60
      arrivalRate: 1000
scenarios:
  - name: "Retrieve an image carousel"
    flow:
      - function: 'randomizer'
      - get:
          url: "api/pictures/{{id}}"